> [@snoby](https://github.com/snoby) can you try `image = "images:ubuntu:24.04"`?

so i changed it as suggested
```
Terraform will perform the following actions:

  # incus_instance.main will be created
  + resource "incus_instance" "main" {
      + config       = {
          + "boot.autostart" = "true"
        }
      + ephemeral    = false
      + image        = "images:ubuntu:24.04"
      + ipv4_address = (known after apply)
      + ipv6_address = (known after apply)
      + mac_address  = (known after apply)
      + name         = "terraform-instance"
      + profiles     = [
          + "default",
        ]
      + project      = "database"
      + remote       = "lxd-3"
      + running      = true
      + status       = (known after apply)
      + target       = (known after apply)
      + type         = "container"

      + device {
          + name       = "root"
          + properties = {
              + "path" = "/"
              + "pool" = "default"
              + "size" = "140GB"
            }
          + type       = "disk"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
and 
Got the error that the image could not be found.



## Complete log
```
2025-04-06T17:44:07.646-0400 [DEBUG] No provider meta schema returned
2025-04-06T17:44:07.648-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: 2025/04/06 17:44:07 [DEBUG] Incus Config: &cliconfig.Config{DefaultRemote:"lxd-3", Remotes:map[string]cliconfig.Remote{"images":cliconfig.Remote{Addr:"https://images.linuxcontainers.org", AuthType:"", KeepAlive:0, Project:"", Protocol:"simplestreams", Public:true, Global:false, Static:false}, "local":cliconfig.Remote{Addr:"unix://", AuthType:"", KeepAlive:0, Project:"", Protocol:"incus", Public:false, Global:false, Static:true}, "lxd-3":cliconfig.Remote{Addr:"https://10.0.0.237:8443", AuthType:"tls", KeepAlive:0, Project:"default", Protocol:"incus", Public:false, Global:false, Static:false}, "theminer":cliconfig.Remote{Addr:"https://10.0.0.167:8443", AuthType:"tls", KeepAlive:0, Project:"default", Protocol:"incus", Public:false, Global:false, Static:false}}, Aliases:map[string]string{}, ConfigDir:"/Users/snoby/.config/incus", CacheDir:"", UserAgent:"", PromptPassword:(func(string) (string, error))(nil), ProjectOverride:"", oidcTokens:map[string]*oidc.Tokens[*github.com/zitadel/oidc/v3/pkg/oidc.IDTokenClaims](nil)}
2025-04-06T17:44:07.648-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: 2025/04/06 17:44:07 [DEBUG] Incus Provider: (**config.IncusProviderConfig)(0x14000088128)
2025-04-06T17:44:07.648-0400 [DEBUG] skipping FixUpBlockAttrs
2025-04-06T17:44:07.651-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: Marking Computed attributes with null configuration values as unknown (known after apply) in the plan to prevent potential Terraform errors: @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:229 @module=sdk.framework tf_provider_addr=registry.terraform.io/lxc/incus tf_req_id=298bfc57-4d0a-fb4d-2396-e6397005fc3f tf_rpc=PlanResourceChange tf_resource_type=incus_instance timestamp=2025-04-06T17:44:07.651-0400
2025-04-06T17:44:07.651-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @module=sdk.framework tf_provider_addr=registry.terraform.io/lxc/incus tf_req_id=298bfc57-4d0a-fb4d-2396-e6397005fc3f @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 tf_attribute_path=AttributeName("ipv4_address") tf_resource_type=incus_instance tf_rpc=PlanResourceChange timestamp=2025-04-06T17:44:07.651-0400
2025-04-06T17:44:07.651-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @module=sdk.framework tf_resource_type=incus_instance tf_attribute_path=AttributeName("mac_address") tf_provider_addr=registry.terraform.io/lxc/incus tf_req_id=298bfc57-4d0a-fb4d-2396-e6397005fc3f tf_rpc=PlanResourceChange @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 timestamp=2025-04-06T17:44:07.651-0400
2025-04-06T17:44:07.651-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 tf_attribute_path=AttributeName("target") tf_provider_addr=registry.terraform.io/lxc/incus tf_req_id=298bfc57-4d0a-fb4d-2396-e6397005fc3f @module=sdk.framework tf_resource_type=incus_instance tf_rpc=PlanResourceChange timestamp=2025-04-06T17:44:07.651-0400
2025-04-06T17:44:07.651-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 @module=sdk.framework tf_provider_addr=registry.terraform.io/lxc/incus tf_resource_type=incus_instance tf_rpc=PlanResourceChange tf_attribute_path=AttributeName("ipv6_address") tf_req_id=298bfc57-4d0a-fb4d-2396-e6397005fc3f timestamp=2025-04-06T17:44:07.651-0400
2025-04-06T17:44:07.651-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: tf_attribute_path=AttributeName("status") tf_resource_type=incus_instance tf_rpc=PlanResourceChange @module=sdk.framework tf_req_id=298bfc57-4d0a-fb4d-2396-e6397005fc3f @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 tf_provider_addr=registry.terraform.io/lxc/incus timestamp=2025-04-06T17:44:07.651-0400
2025-04-06T17:44:07.651-0400 [DEBUG] provider.terraform-provider-incus_v0.3.1: marking computed attribute that is null in the config as unknown: @module=sdk.framework tf_provider_addr=registry.terraform.io/lxc/incus tf_req_id=298bfc57-4d0a-fb4d-2396-e6397005fc3f tf_resource_type=incus_instance tf_rpc=PlanResourceChange @caller=github.com/hashicorp/terraform-plugin-framework@v1.14.1/internal/fwserver/server_planresourcechange.go:480 tf_attribute_path=AttributeName("profiles") timestamp=2025-04-06T17:44:07.651-0400
incus_instance.main: Creating...
2025-04-06T17:44:07.653-0400 [INFO]  Starting apply for incus_instance.main
2025-04-06T17:44:07.653-0400 [DEBUG] skipping FixUpBlockAttrs
2025-04-06T17:44:07.653-0400 [DEBUG] incus_instance.main: applying the planned Create change
2025-04-06T17:44:08.381-0400 [ERROR] provider.terraform-provider-incus_v0.3.1: Response contains error diagnostic: tf_req_id=de02ba9d-7ea6-dbed-50d1-5b926ede9cd6 tf_rpc=ApplyResourceChange @caller=github.com/hashicorp/terraform-plugin-go@v0.26.0/tfprotov6/internal/diag/diagnostics.go:58 @module=sdk.proto diagnostic_summary="Failed to create instance "terraform-instance"" tf_proto_version=6.8 diagnostic_severity=ERROR tf_provider_addr=registry.terraform.io/lxc/incus tf_resource_type=incus_instance diagnostic_detail="Failed instance creation: Failed getting remote image info: Failed getting image: The requested image couldn't be found" timestamp=2025-04-06T17:44:08.381-0400
2025-04-06T17:44:08.387-0400 [DEBUG] State storage *statemgr.Filesystem declined to persist a state snapshot
2025-04-06T17:44:08.387-0400 [ERROR] vertex "incus_instance.main" error: Failed to create instance "terraform-instance"
╷
│ Error: Failed to create instance "terraform-instance"
│
│   with incus_instance.main,
│   on instances.tf line 1, in resource "incus_instance" "main":
│    1: resource "incus_instance" "main" {
│
│ Failed instance creation: Failed getting remote image info: Failed getting image: The requested image couldn't be found
╵
2025-04-06T17:44:08.396-0400 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2025-04-06T17:44:08.397-0400 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/lxc/incus/0.3.1/darwin_arm64/terraform-provider-incus_v0.3.1 pid=60407
2025-04-06T17:44:08.397-0400 [DEBUG] provider: plugin exited
```